results/resilience/aerospike_sow2-production_aws-cassandra-503-32-threads-resilience-v2_0_hmo5fsem/0_load.txt
bin/ycsb load cassandra4-cql -s -jvm-args=-XX:MaxRAMPercentage=85.0  -p hosts=172.31.21.198,172.31.31.89,172.31.30.203,172.31.24.16,172.31.16.53,172.31.17.149 -p cassandra.keyspace=ycsb -p cassandra.username=benchant -p cassandra.password=Performance99 -p cassandra.initDefaultTable=false -p cassandra.useSecureBundle=false -p  cassandra.writeconsistencylevel=QUORUM -p workload=site.ycsb.workloads.CoreWorkload -threads 32 -p recordcount=50000000 -p operationcount=4400000000 -p fieldcount=10 -p fieldlength=200 -p requestdistribution=uniform-growing -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.06 -p insertproportion=0.4 -p scanproportion=0.0 -p maxscanlength=1000 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p reportlatencyforeacherror=true -p insertstart=0  -p hdrhistogram.percentiles=50,90,95,99,99.99,99.99999 
/usr/lib/jvm/java-1.8.0-openjdk-amd64/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/cassandra4-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/core-0.18.0-SNAPSHOT.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/lib/HdrHistogram-2.1.4.jar:/binary/ycsb/cassandra4-binding/lib/asm-tree-9.1.jar:/binary/ycsb/cassandra4-binding/lib/asm-analysis-9.1.jar:/binary/ycsb/cassandra4-binding/lib/netty-handler-4.1.60.Final.jar:/binary/ycsb/cassandra4-binding/lib/netty-codec-4.1.60.Final.jar:/binary/ycsb/cassandra4-binding/lib/slf4j-simple-1.7.21.jar:/binary/ycsb/cassandra4-binding/lib/jackson-annotations-2.12.2.jar:/binary/ycsb/cassandra4-binding/lib/jackson-core-2.12.2.jar:/binary/ycsb/cassandra4-binding/lib/jnr-posix-3.1.5.jar:/binary/ycsb/cassandra4-binding/lib/asm-9.1.jar:/binary/ycsb/cassandra4-binding/lib/spotbugs-annotations-3.1.12.jar:/binary/ycsb/cassandra4-binding/lib/json-20090211.jar:/binary/ycsb/cassandra4-binding/lib/netty-buffer-4.1.60.Final.jar:/binary/ycsb/cassandra4-binding/lib/netty-common-4.1.60.Final.jar:/binary/ycsb/cassandra4-binding/lib/jffi-1.3.1-native.jar:/binary/ycsb/cassandra4-binding/lib/reactive-streams-1.0.3.jar:/binary/ycsb/cassandra4-binding/lib/netty-transport-4.1.60.Final.jar:/binary/ycsb/cassandra4-binding/lib/java-driver-core-4.13.0.jar:/binary/ycsb/cassandra4-binding/lib/asm-commons-9.1.jar:/binary/ycsb/cassandra4-binding/lib/java-driver-query-builder-4.13.0.jar:/binary/ycsb/cassandra4-binding/lib/jsr305-3.0.2.jar:/binary/ycsb/cassandra4-binding/lib/jnr-constants-0.10.1.jar:/binary/ycsb/cassandra4-binding/lib/metrics-core-4.1.18.jar:/binary/ycsb/cassandra4-binding/lib/netty-resolver-4.1.60.Final.jar:/binary/ycsb/cassandra4-binding/lib/jackson-databind-2.12.2.jar:/binary/ycsb/cassandra4-binding/lib/config-1.4.1.jar:/binary/ycsb/cassandra4-binding/lib/esri-geometry-api-1.2.1.jar:/binary/ycsb/cassandra4-binding/lib/java-driver-shaded-guava-25.1-jre-graal-sub-1.jar:/binary/ycsb/cassandra4-binding/lib/asm-util-9.1.jar:/binary/ycsb/cassandra4-binding/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/cassandra4-binding/lib/jffi-1.3.1.jar:/binary/ycsb/cassandra4-binding/lib/cassandra4-binding-0.18.0-SNAPSHOT.jar:/binary/ycsb/cassandra4-binding/lib/jcip-annotations-1.0-1.jar:/binary/ycsb/cassandra4-binding/lib/native-protocol-1.5.0.jar:/binary/ycsb/cassandra4-binding/lib/jnr-a64asm-1.0.0.jar:/binary/ycsb/cassandra4-binding/lib/jnr-x86asm-1.0.2.jar:/binary/ycsb/cassandra4-binding/lib/jnr-ffi-2.2.2.jar:/binary/ycsb/cassandra4-binding/lib/HdrHistogram-2.1.12.jar:/binary/ycsb/cassandra4-binding/lib/slf4j-api-1.7.25.jar site.ycsb.Client -db site.ycsb.db.cassandra4.CassandraCQLClient -s -p hosts=172.31.21.198,172.31.31.89,172.31.30.203,172.31.24.16,172.31.16.53,172.31.17.149 -p cassandra.keyspace=ycsb -p cassandra.username=benchant -p cassandra.password=Performance99 -p cassandra.initDefaultTable=false -p cassandra.useSecureBundle=false -p cassandra.writeconsistencylevel=QUORUM -p workload=site.ycsb.workloads.CoreWorkload -threads 32 -p recordcount=50000000 -p operationcount=4400000000 -p fieldcount=10 -p fieldlength=200 -p requestdistribution=uniform-growing -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.06 -p insertproportion=0.4 -p scanproportion=0.0 -p maxscanlength=1000 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p reportlatencyforeacherror=true -p insertstart=0 -p hdrhistogram.percentiles=50,90,95,99,99.99,99.99999 -load
Command line: -db site.ycsb.db.cassandra4.CassandraCQLClient -s -p hosts=172.31.21.198,172.31.31.89,172.31.30.203,172.31.24.16,172.31.16.53,172.31.17.149 -p cassandra.keyspace=ycsb -p cassandra.username=benchant -p cassandra.password=Performance99 -p cassandra.initDefaultTable=false -p cassandra.useSecureBundle=false -p cassandra.writeconsistencylevel=QUORUM -p workload=site.ycsb.workloads.CoreWorkload -threads 32 -p recordcount=50000000 -p operationcount=4400000000 -p fieldcount=10 -p fieldlength=200 -p requestdistribution=uniform-growing -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.06 -p insertproportion=0.4 -p scanproportion=0.0 -p maxscanlength=1000 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p reportlatencyforeacherror=true -p insertstart=0 -p hdrhistogram.percentiles=50,90,95,99,99.99,99.99999 -load
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
insertstart, insertcount, recordcount: 0, 50000000, 50000000
CoreWorkload init --- orderedinserts: true
Starting test.
[Thread-27] INFO site.ycsb.db.cassandra4.CassandraCQLClient - setting read (and default) Consistency to 'QUORUM'
[Thread-27] INFO site.ycsb.db.cassandra4.CassandraCQLClient - setting write Consistency to 'QUORUM'
2025-03-29 07:27:36:588 0 sec: 0 operations; est completion in 0 second 
[Thread-27] INFO com.datastax.oss.driver.internal.core.DefaultMavenCoordinates - DataStax Java driver for Apache Cassandra(R) (com.datastax.oss:java-driver-core) version 4.13.0
[s0-admin-0] INFO com.datastax.oss.driver.internal.core.time.Clock - Using native clock for microsecond precision
[s0-io-2] WARN com.datastax.oss.driver.api.core.auth.PlainTextAuthProviderBase - [] /172.31.16.53:9042 did not send an authentication challenge; This is suspicious because the driver expects authentication
[s0-io-3] WARN com.datastax.oss.driver.api.core.auth.PlainTextAuthProviderBase - [] /172.31.16.53:9042 did not send an authentication challenge; This is suspicious because the driver expects authentication
[s0-io-4] WARN com.datastax.oss.driver.api.core.auth.PlainTextAuthProviderBase - [] /172.31.21.198:9042 did not send an authentication challenge; This is suspicious because the driver expects authentication
[s0-io-8] WARN com.datastax.oss.driver.api.core.auth.PlainTextAuthProviderBase - [] /172.31.24.16:9042 did not send an authentication challenge; This is suspicious because the driver expects authentication
[s0-io-7] WARN com.datastax.oss.driver.api.core.auth.PlainTextAuthProviderBase - [] /172.31.31.89:9042 did not send an authentication challenge; This is suspicious because the driver expects authentication
[s0-io-6] WARN com.datastax.oss.driver.api.core.auth.PlainTextAuthProviderBase - [] /172.31.17.149:9042 did not send an authentication challenge; This is suspicious because the driver expects authentication
[s0-io-5] WARN com.datastax.oss.driver.api.core.auth.PlainTextAuthProviderBase - [] /172.31.30.203:9042 did not send an authentication challenge; This is suspicious because the driver expects authentication
[Thread-27] INFO site.ycsb.db.cassandra4.CassandraCQLClient - Connected to cluster: Optional[benchANT Cluster]

DBWrapper: report latency for each error is true and specific error codes to track for latency are: []
2025-03-29 07:27:46:579 10 sec: 492243 operations; 49224.3 current ops/sec; est completion in 16 minutes [INSERT: Count=492269, Max=77055, Min=340, Avg=593.11, 90=747, 99=1586, 99.9=3793, 99.99=10839] [INSERT-COMB: Count=492590, Max=77055, Min=340, Avg=593.08, 90=747, 99=1585, 99.9=3783, 99.99=10839] 
2025-03-29 07:27:56:579 20 sec: 1086447 operations; 59420.4 current ops/sec; est completion in 15 minutes [INSERT: Count=594196, Max=118079, Min=342, Avg=536.94, 90=608, 99=866, 99.9=2413, 99.99=4931] [INSERT-COMB: Count=594066, Max=118079, Min=342, Avg=536.94, 90=608, 99=866, 99.9=2413, 99.99=4931] 
2025-03-29 07:28:06:579 30 sec: 1679970 operations; 59352.3 current ops/sec; est completion in 14 minutes [INSERT: Count=593518, Max=8767, Min=341, Avg=537.62, 90=623, 99=898, 99.9=2007, 99.99=4099] [INSERT-COMB: Count=593428, Max=8767, Min=341, Avg=537.62, 90=623, 99=898, 99.9=2007, 99.99=4099] 
2025-03-29 07:28:16:579 40 sec: 2280187 operations; 60021.7 current ops/sec; est completion in 13 minutes [INSERT: Count=600237, Max=9455, Min=323, Avg=531.56, 90=607, 99=860, 99.9=2327, 99.99=4163] [INSERT-COMB: Count=600214, Max=9455, Min=323, Avg=531.56, 90=607, 99=860, 99.9=2327, 99.99=4163] 
2025-03-29 07:28:26:579 50 sec: 2882435 operations; 60224.8 current ops/sec; est completion in 13 minutes [INSERT: Count=602231, Max=6855, Min=336, Avg=529.81, 90=602, 99=852, 99.9=2671, 99.99=4059] [INSERT-COMB: Count=602224, Max=6855, Min=336, Avg=529.82, 90=602, 99=852, 99.9=2671, 99.99=4059] 
2025-03-29 07:28:36:579 60 sec: 3454818 operations; 57238.3 current ops/sec; est completion in 13 minutes [INSERT: Count=572384, Max=221055, Min=340, Avg=557.5, 90=614, 99=940, 99.9=3587, 99.99=13039] [INSERT-COMB: Count=572419, Max=221055, Min=340, Avg=557.5, 90=614, 99=940, 99.9=3587, 99.99=13039] 
2025-03-29 07:28:46:579 70 sec: 4052542 operations; 59772.4 current ops/sec; est completion in 13 minutes [INSERT: Count=597719, Max=8131, Min=344, Avg=533.85, 90=607, 99=889, 99.9=2795, 99.99=3923] [INSERT-COMB: Count=597675, Max=8131, Min=344, Avg=533.85, 90=607, 99=889, 99.9=2795, 99.99=3923] 
2025-03-29 07:28:56:579 80 sec: 4646342 operations; 59380 current ops/sec; est completion in 13 minutes [INSERT: Count=593811, Max=8263, Min=340, Avg=537.37, 90=611, 99=896, 99.9=2833, 99.99=4215] [INSERT-COMB: Count=593813, Max=8263, Min=340, Avg=537.36, 90=611, 99=896, 99.9=2833, 99.99=4215] 
2025-03-29 07:29:06:579 90 sec: 5244035 operations; 59769.3 current ops/sec; est completion in 12 minutes [INSERT: Count=597694, Max=7867, Min=333, Avg=533.89, 90=606, 99=880, 99.9=2769, 99.99=4021] [INSERT-COMB: Count=597687, Max=7867, Min=333, Avg=533.89, 90=606, 99=880, 99.9=2769, 99.99=4021] 
2025-03-29 07:29:16:579 100 sec: 5844064 operations; 60002.9 current ops/sec; est completion in 12 minutes [INSERT: Count=600025, Max=9719, Min=336, Avg=531.77, 90=604, 99=886, 99.9=2641, 99.99=3923] [INSERT-COMB: Count=600095, Max=9719, Min=336, Avg=531.76, 90=604, 99=886, 99.9=2641, 99.99=3923] 
2025-03-29 07:29:26:579 110 sec: 6432085 operations; 58802.1 current ops/sec; est completion in 12 minutes [INSERT: Count=588017, Max=7307, Min=333, Avg=542.69, 90=619, 99=922, 99.9=2871, 99.99=4211] [INSERT-COMB: Count=587954, Max=7307, Min=333, Avg=542.7, 90=619, 99=922, 99.9=2871, 99.99=4211] 
2025-03-29 07:29:36:579 120 sec: 7019562 operations; 58747.7 current ops/sec; est completion in 12 minutes [INSERT: Count=587476, Max=8831, Min=329, Avg=543.17, 90=620, 99=939, 99.9=2751, 99.99=4367] [INSERT-COMB: Count=587478, Max=8831, Min=329, Avg=543.17, 90=620, 99=939, 99.9=2751, 99.99=4367] 
2025-03-29 07:29:46:579 130 sec: 7609168 operations; 58960.6 current ops/sec; est completion in 12 minutes [INSERT: Count=589606, Max=8431, Min=347, Avg=541.19, 90=614, 99=910, 99.9=2719, 99.99=3989] [INSERT-COMB: Count=589600, Max=8431, Min=347, Avg=541.19, 90=614, 99=910, 99.9=2719, 99.99=3989] 
2025-03-29 07:29:56:579 140 sec: 8201511 operations; 59234.3 current ops/sec; est completion in 11 minutes [INSERT: Count=592343, Max=8959, Min=344, Avg=538.68, 90=612, 99=906, 99.9=2691, 99.99=4223] [INSERT-COMB: Count=592407, Max=8959, Min=344, Avg=538.68, 90=612, 99=906, 99.9=2691, 99.99=4223] 
2025-03-29 07:30:06:579 150 sec: 8789651 operations; 58814 current ops/sec; est completion in 11 minutes [INSERT: Count=588139, Max=9991, Min=347, Avg=542.56, 90=617, 99=917, 99.9=2809, 99.99=4263] [INSERT-COMB: Count=588077, Max=9991, Min=347, Avg=542.57, 90=617, 99=917, 99.9=2809, 99.99=4263] 
2025-03-29 07:30:16:579 160 sec: 9376342 operations; 58669.1 current ops/sec; est completion in 11 minutes [INSERT: Count=586692, Max=9607, Min=336, Avg=543.9, 90=619, 99=931, 99.9=2749, 99.99=4355] [INSERT-COMB: Count=586685, Max=9607, Min=336, Avg=543.89, 90=619, 99=931, 99.9=2749, 99.99=4355] 
2025-03-29 07:30:26:579 170 sec: 9968114 operations; 59177.2 current ops/sec; est completion in 11 minutes [INSERT: Count=591770, Max=7423, Min=347, Avg=539.21, 90=612, 99=910, 99.9=2805, 99.99=4295] [INSERT-COMB: Count=591830, Max=7423, Min=347, Avg=539.21, 90=612, 99=910, 99.9=2805, 99.99=4295] 
2025-03-29 07:30:36:579 180 sec: 10556013 operations; 58789.9 current ops/sec; est completion in 11 minutes [INSERT: Count=587901, Max=7531, Min=345, Avg=542.78, 90=615, 99=919, 99.9=2779, 99.99=4183] [INSERT-COMB: Count=587827, Max=7531, Min=345, Avg=542.78, 90=615, 99=919, 99.9=2779, 99.99=4183] 
2025-03-29 07:30:46:579 190 sec: 11145380 operations; 58936.7 current ops/sec; est completion in 11 minutes [INSERT: Count=589360, Max=7295, Min=342, Avg=541.42, 90=616, 99=919, 99.9=2651, 99.99=4033] [INSERT-COMB: Count=589427, Max=7295, Min=342, Avg=541.42, 90=616, 99=919, 99.9=2651, 99.99=4033] 
2025-03-29 07:30:56:579 200 sec: 11735633 operations; 59025.3 current ops/sec; est completion in 10 minutes [INSERT: Count=590252, Max=6323, Min=342, Avg=540.61, 90=614, 99=919, 99.9=2701, 99.99=3939] [INSERT-COMB: Count=590188, Max=6323, Min=342, Avg=540.61, 90=614, 99=919, 99.9=2701, 99.99=3939] 
2025-03-29 07:31:06:579 210 sec: 12326961 operations; 59132.8 current ops/sec; est completion in 10 minutes [INSERT: Count=591328, Max=8179, Min=340, Avg=539.6, 90=614, 99=909, 99.9=2723, 99.99=3917] [INSERT-COMB: Count=591320, Max=8179, Min=340, Avg=539.6, 90=614, 99=909, 99.9=2723, 99.99=3917] 
2025-03-29 07:31:16:579 220 sec: 12918333 operations; 59137.2 current ops/sec; est completion in 10 minutes [INSERT: Count=591388, Max=8871, Min=349, Avg=539.55, 90=612, 99=912, 99.9=2677, 99.99=4343] [INSERT-COMB: Count=591380, Max=8871, Min=349, Avg=539.56, 90=612, 99=912, 99.9=2677, 99.99=4343] 
2025-03-29 07:31:26:579 230 sec: 13502817 operations; 58448.4 current ops/sec; est completion in 10 minutes [INSERT: Count=584474, Max=6215, Min=354, Avg=545.94, 90=619, 99=928, 99.9=2821, 99.99=4073] [INSERT-COMB: Count=584481, Max=6215, Min=354, Avg=545.94, 90=619, 99=928, 99.9=2821, 99.99=4073] 
2025-03-29 07:31:36:579 240 sec: 14083474 operations; 58065.7 current ops/sec; est completion in 10 minutes [INSERT: Count=580650, Max=28879, Min=347, Avg=549.54, 90=626, 99=961, 99.9=2789, 99.99=4411] [INSERT-COMB: Count=580663, Max=28879, Min=347, Avg=549.54, 90=626, 99=961, 99.9=2789, 99.99=4411] 
2025-03-29 07:31:46:579 250 sec: 14666273 operations; 58279.9 current ops/sec; est completion in 10 minutes [INSERT: Count=582797, Max=9199, Min=347, Avg=547.49, 90=622, 99=947, 99.9=2797, 99.99=4283] [INSERT-COMB: Count=582797, Max=9199, Min=347, Avg=547.49, 90=622, 99=947, 99.9=2797, 99.99=4283] 
2025-03-29 07:31:56:579 260 sec: 15249507 operations; 58323.4 current ops/sec; est completion in 9 minutes [INSERT: Count=583243, Max=7919, Min=345, Avg=547.1, 90=622, 99=956, 99.9=2665, 99.99=3885] [INSERT-COMB: Count=583232, Max=7919, Min=345, Avg=547.1, 90=622, 99=956, 99.9=2665, 99.99=3885] 
2025-03-29 07:32:06:579 270 sec: 15832741 operations; 58323.4 current ops/sec; est completion in 9 minutes [INSERT: Count=583230, Max=10071, Min=350, Avg=547.14, 90=621, 99=952, 99.9=2781, 99.99=4579] [INSERT-COMB: Count=583237, Max=10071, Min=350, Avg=547.14, 90=621, 99=952, 99.9=2781, 99.99=4579] 
2025-03-29 07:32:16:579 280 sec: 16417585 operations; 58484.4 current ops/sec; est completion in 9 minutes [INSERT: Count=584845, Max=8415, Min=342, Avg=545.62, 90=620, 99=937, 99.9=2735, 99.99=4279] [INSERT-COMB: Count=584841, Max=8415, Min=342, Avg=545.61, 90=620, 99=937, 99.9=2735, 99.99=4279] 
2025-03-29 07:32:26:579 290 sec: 17003187 operations; 58560.2 current ops/sec; est completion in 9 minutes [INSERT: Count=585600, Max=7371, Min=347, Avg=544.9, 90=618, 99=936, 99.9=2739, 99.99=4175] [INSERT-COMB: Count=585595, Max=7371, Min=347, Avg=544.91, 90=618, 99=936, 99.9=2739, 99.99=4175] 
2025-03-29 07:32:36:579 300 sec: 17587942 operations; 58475.5 current ops/sec; est completion in 9 minutes [INSERT: Count=584758, Max=11631, Min=350, Avg=545.68, 90=618, 99=937, 99.9=2901, 99.99=4303] [INSERT-COMB: Count=584760, Max=11631, Min=350, Avg=545.68, 90=618, 99=937, 99.9=2901, 99.99=4303] 
2025-03-29 07:32:46:579 310 sec: 18169135 operations; 58119.3 current ops/sec; est completion in 9 minutes [INSERT: Count=581194, Max=9695, Min=338, Avg=549.03, 90=622, 99=965, 99.9=2923, 99.99=4675] [INSERT-COMB: Count=581199, Max=9695, Min=338, Avg=549.03, 90=622, 99=965, 99.9=2923, 99.99=4675] 
2025-03-29 07:32:56:579 320 sec: 18751107 operations; 58197.2 current ops/sec; est completion in 8 minutes [INSERT: Count=581964, Max=7635, Min=336, Avg=548.3, 90=623, 99=959, 99.9=2751, 99.99=4255] [INSERT-COMB: Count=581965, Max=7635, Min=336, Avg=548.3, 90=623, 99=959, 99.9=2751, 99.99=4255] 
2025-03-29 07:33:06:579 330 sec: 19334582 operations; 58347.5 current ops/sec; est completion in 8 minutes [INSERT: Count=583479, Max=8407, Min=344, Avg=546.88, 90=620, 99=945, 99.9=2761, 99.99=4323] [INSERT-COMB: Count=583471, Max=8407, Min=344, Avg=546.88, 90=620, 99=945, 99.9=2761, 99.99=4323] 
2025-03-29 07:33:16:579 340 sec: 19916509 operations; 58192.7 current ops/sec; est completion in 8 minutes [INSERT: Count=581934, Max=8703, Min=350, Avg=548.35, 90=623, 99=951, 99.9=2779, 99.99=4227] [INSERT-COMB: Count=581930, Max=8703, Min=350, Avg=548.35, 90=623, 99=951, 99.9=2779, 99.99=4227] 
2025-03-29 07:33:26:579 350 sec: 20502334 operations; 58582.5 current ops/sec; est completion in 8 minutes [INSERT: Count=585818, Max=10367, Min=348, Avg=544.7, 90=618, 99=937, 99.9=2759, 99.99=4199] [INSERT-COMB: Count=585835, Max=10367, Min=348, Avg=544.7, 90=618, 99=937, 99.9=2759, 99.99=4199] 
2025-03-29 07:33:36:579 360 sec: 21086346 operations; 58401.2 current ops/sec; est completion in 8 minutes [INSERT: Count=584016, Max=8783, Min=336, Avg=546.38, 90=621, 99=940, 99.9=2763, 99.99=4415] [INSERT-COMB: Count=584016, Max=8783, Min=336, Avg=546.38, 90=621, 99=940, 99.9=2763, 99.99=4415] 
2025-03-29 07:33:46:579 370 sec: 21670944 operations; 58459.8 current ops/sec; est completion in 8 minutes [INSERT: Count=584597, Max=8159, Min=349, Avg=545.86, 90=619, 99=953, 99.9=2687, 99.99=4131] [INSERT-COMB: Count=584590, Max=8159, Min=349, Avg=545.86, 90=619, 99=953, 99.9=2687, 99.99=4131] 
2025-03-29 07:33:56:579 380 sec: 22253596 operations; 58265.2 current ops/sec; est completion in 7 minutes [INSERT: Count=582641, Max=8167, Min=344, Avg=547.67, 90=625, 99=969, 99.9=2873, 99.99=4147] [INSERT-COMB: Count=582659, Max=8167, Min=344, Avg=547.67, 90=625, 99=969, 99.9=2873, 99.99=4147] 
2025-03-29 07:34:06:579 390 sec: 22840146 operations; 58655 current ops/sec; est completion in 7 minutes [INSERT: Count=586563, Max=10687, Min=342, Avg=544.02, 90=618, 99=934, 99.9=2669, 99.99=4039] [INSERT-COMB: Count=586546, Max=10687, Min=342, Avg=544.02, 90=618, 99=934, 99.9=2669, 99.99=4039] 
2025-03-29 07:34:16:579 400 sec: 23426067 operations; 58592.1 current ops/sec; est completion in 7 minutes [INSERT: Count=585918, Max=8063, Min=348, Avg=544.62, 90=617, 99=940, 99.9=2721, 99.99=4371] [INSERT-COMB: Count=585982, Max=8063, Min=348, Avg=544.62, 90=617, 99=940, 99.9=2721, 99.99=4371] 
2025-03-29 07:34:26:579 410 sec: 24009859 operations; 58379.2 current ops/sec; est completion in 7 minutes [INSERT: Count=583791, Max=7827, Min=336, Avg=546.62, 90=622, 99=947, 99.9=2841, 99.99=4351] [INSERT-COMB: Count=583727, Max=7827, Min=336, Avg=546.62, 90=622, 99=947, 99.9=2841, 99.99=4351] 
2025-03-29 07:34:36:579 420 sec: 24597012 operations; 58715.3 current ops/sec; est completion in 7 minutes [INSERT: Count=587152, Max=9679, Min=341, Avg=543.46, 90=617, 99=933, 99.9=2667, 99.99=4023] [INSERT-COMB: Count=587150, Max=9679, Min=341, Avg=543.46, 90=617, 99=933, 99.9=2667, 99.99=4023] 
2025-03-29 07:34:46:579 430 sec: 25183829 operations; 58681.7 current ops/sec; est completion in 7 minutes [INSERT: Count=586815, Max=6435, Min=346, Avg=543.74, 90=618, 99=939, 99.9=2731, 99.99=3993] [INSERT-COMB: Count=586813, Max=6435, Min=346, Avg=543.74, 90=618, 99=939, 99.9=2731, 99.99=3993] 
2025-03-29 07:34:56:579 440 sec: 25764649 operations; 58082 current ops/sec; est completion in 6 minutes [INSERT: Count=580822, Max=8223, Min=346, Avg=549.41, 90=624, 99=960, 99.9=2827, 99.99=4387] [INSERT-COMB: Count=580823, Max=8223, Min=346, Avg=549.41, 90=624, 99=960, 99.9=2827, 99.99=4387] 
2025-03-29 07:35:06:579 450 sec: 26350299 operations; 58565 current ops/sec; est completion in 6 minutes [INSERT: Count=585649, Max=7771, Min=347, Avg=544.86, 90=620, 99=945, 99.9=2717, 99.99=4151] [INSERT-COMB: Count=585713, Max=7771, Min=347, Avg=544.85, 90=620, 99=945, 99.9=2717, 99.99=4151] 
2025-03-29 07:35:16:579 460 sec: 26937488 operations; 58718.9 current ops/sec; est completion in 6 minutes [INSERT: Count=587197, Max=7311, Min=352, Avg=543.44, 90=618, 99=937, 99.9=2719, 99.99=4027] [INSERT-COMB: Count=587132, Max=7311, Min=352, Avg=543.44, 90=618, 99=937, 99.9=2719, 99.99=4027] 
2025-03-29 07:35:26:579 470 sec: 27521945 operations; 58445.7 current ops/sec; est completion in 6 minutes [INSERT: Count=584448, Max=8351, Min=336, Avg=545.95, 90=620, 99=933, 99.9=2725, 99.99=4295] [INSERT-COMB: Count=584452, Max=8351, Min=336, Avg=545.95, 90=620, 99=933, 99.9=2725, 99.99=4295] 
2025-03-29 07:35:36:579 480 sec: 28108048 operations; 58610.3 current ops/sec; est completion in 6 minutes [INSERT: Count=586107, Max=16879, Min=338, Avg=544.45, 90=620, 99=947, 99.9=2715, 99.99=4247] [INSERT-COMB: Count=586100, Max=16879, Min=338, Avg=544.45, 90=620, 99=947, 99.9=2715, 99.99=4247] 
2025-03-29 07:35:46:579 490 sec: 28689968 operations; 58192 current ops/sec; est completion in 6 minutes [INSERT: Count=581916, Max=7215, Min=350, Avg=548.36, 90=622, 99=960, 99.9=2851, 99.99=4367] [INSERT-COMB: Count=581922, Max=7215, Min=350, Avg=548.36, 90=622, 99=960, 99.9=2851, 99.99=4367] 
2025-03-29 07:35:56:579 500 sec: 29276993 operations; 58702.5 current ops/sec; est completion in 5 minutes [INSERT: Count=587028, Max=10055, Min=339, Avg=543.58, 90=617, 99=938, 99.9=2811, 99.99=4103] [INSERT-COMB: Count=587021, Max=10055, Min=339, Avg=543.58, 90=617, 99=938, 99.9=2811, 99.99=4103] 
2025-03-29 07:36:06:579 510 sec: 29861740 operations; 58474.7 current ops/sec; est completion in 5 minutes [INSERT: Count=584743, Max=7951, Min=334, Avg=545.69, 90=620, 99=944, 99.9=2755, 99.99=4267] [INSERT-COMB: Count=584738, Max=7951, Min=334, Avg=545.69, 90=620, 99=944, 99.9=2755, 99.99=4267] 
2025-03-29 07:36:16:579 520 sec: 30447808 operations; 58606.8 current ops/sec; est completion in 5 minutes [INSERT: Count=586071, Max=8575, Min=345, Avg=544.47, 90=619, 99=947, 99.9=2655, 99.99=4291] [INSERT-COMB: Count=586080, Max=8575, Min=345, Avg=544.47, 90=619, 99=947, 99.9=2655, 99.99=4291] 
2025-03-29 07:36:26:579 530 sec: 31035247 operations; 58743.9 current ops/sec; est completion in 5 minutes [INSERT: Count=587435, Max=8139, Min=340, Avg=543.19, 90=616, 99=945, 99.9=2675, 99.99=4259] [INSERT-COMB: Count=587431, Max=8139, Min=340, Avg=543.2, 90=616, 99=945, 99.9=2675, 99.99=4259] 
2025-03-29 07:36:36:579 540 sec: 31621916 operations; 58666.9 current ops/sec; est completion in 5 minutes [INSERT: Count=586674, Max=6483, Min=341, Avg=543.93, 90=618, 99=934, 99.9=2641, 99.99=4009] [INSERT-COMB: Count=586673, Max=6483, Min=341, Avg=543.93, 90=618, 99=934, 99.9=2641, 99.99=4009] 
2025-03-29 07:36:46:579 550 sec: 32208804 operations; 58688.8 current ops/sec; est completion in 5 minutes [INSERT: Count=586887, Max=7635, Min=348, Avg=543.68, 90=617, 99=943, 99.9=2693, 99.99=4247] [INSERT-COMB: Count=586897, Max=7635, Min=348, Avg=543.68, 90=617, 99=943, 99.9=2693, 99.99=4247] 
2025-03-29 07:36:56:579 560 sec: 32793341 operations; 58453.7 current ops/sec; est completion in 4 minutes [INSERT: Count=584537, Max=7767, Min=339, Avg=545.89, 90=621, 99=948, 99.9=2861, 99.99=4183] [INSERT-COMB: Count=584531, Max=7767, Min=339, Avg=545.89, 90=621, 99=948, 99.9=2861, 99.99=4183] 
2025-03-29 07:37:06:579 570 sec: 33379624 operations; 58628.3 current ops/sec; est completion in 4 minutes [INSERT: Count=586288, Max=7331, Min=340, Avg=544.28, 90=619, 99=942, 99.9=2689, 99.99=4081] [INSERT-COMB: Count=586282, Max=7331, Min=340, Avg=544.27, 90=619, 99=942, 99.9=2689, 99.99=4081] 
2025-03-29 07:37:16:579 580 sec: 33964670 operations; 58504.6 current ops/sec; est completion in 4 minutes [INSERT: Count=585037, Max=8131, Min=350, Avg=545.45, 90=618, 99=948, 99.9=2677, 99.99=4111] [INSERT-COMB: Count=585044, Max=8131, Min=350, Avg=545.45, 90=618, 99=948, 99.9=2677, 99.99=4111] 
2025-03-29 07:37:26:579 590 sec: 34545875 operations; 58120.5 current ops/sec; est completion in 4 minutes [INSERT: Count=581210, Max=9727, Min=351, Avg=549.04, 90=624, 99=976, 99.9=2711, 99.99=4307] [INSERT-COMB: Count=581214, Max=9727, Min=351, Avg=549.04, 90=624, 99=976, 99.9=2711, 99.99=4307] 
2025-03-29 07:37:36:579 600 sec: 35134598 operations; 58872.3 current ops/sec; est completion in 4 minutes [INSERT: Count=588722, Max=7631, Min=340, Avg=542, 90=616, 99=949, 99.9=2625, 99.99=4083] [INSERT-COMB: Count=588713, Max=7631, Min=340, Avg=542, 90=616, 99=949, 99.9=2625, 99.99=4083] 
2025-03-29 07:37:46:579 610 sec: 35719868 operations; 58527 current ops/sec; est completion in 4 minutes [INSERT: Count=585271, Max=7127, Min=331, Avg=545.2, 90=619, 99=939, 99.9=2813, 99.99=3939] [INSERT-COMB: Count=585275, Max=7127, Min=331, Avg=545.2, 90=619, 99=939, 99.9=2813, 99.99=3939] 
2025-03-29 07:37:56:579 620 sec: 36306356 operations; 58648.8 current ops/sec; est completion in 3 minutes [INSERT: Count=586490, Max=8179, Min=342, Avg=544.09, 90=617, 99=936, 99.9=2805, 99.99=4081] [INSERT-COMB: Count=586490, Max=8179, Min=342, Avg=544.09, 90=617, 99=936, 99.9=2805, 99.99=4081] 
2025-03-29 07:38:06:579 630 sec: 36890894 operations; 58453.8 current ops/sec; est completion in 3 minutes [INSERT: Count=584534, Max=8263, Min=340, Avg=545.92, 90=621, 99=957, 99.9=2857, 99.99=4263] [INSERT-COMB: Count=584535, Max=8263, Min=340, Avg=545.92, 90=621, 99=957, 99.9=2857, 99.99=4263] 
2025-03-29 07:38:16:579 640 sec: 37473428 operations; 58253.4 current ops/sec; est completion in 3 minutes [INSERT: Count=582531, Max=7531, Min=349, Avg=547.78, 90=621, 99=955, 99.9=2717, 99.99=4327] [INSERT-COMB: Count=582533, Max=7531, Min=349, Avg=547.78, 90=621, 99=955, 99.9=2717, 99.99=4327] 
2025-03-29 07:38:26:579 650 sec: 38061774 operations; 58834.6 current ops/sec; est completion in 3 minutes [INSERT: Count=588347, Max=7695, Min=332, Avg=542.36, 90=617, 99=937, 99.9=2793, 99.99=4303] [INSERT-COMB: Count=588346, Max=7695, Min=332, Avg=542.36, 90=617, 99=937, 99.9=2793, 99.99=4303] 
2025-03-29 07:38:36:579 660 sec: 38645207 operations; 58343.3 current ops/sec; est completion in 3 minutes [INSERT: Count=583438, Max=7563, Min=340, Avg=546.94, 90=620, 99=966, 99.9=2701, 99.99=4135] [INSERT-COMB: Count=583436, Max=7563, Min=340, Avg=546.94, 90=620, 99=966, 99.9=2701, 99.99=4135] 
2025-03-29 07:38:46:579 670 sec: 39229355 operations; 58414.8 current ops/sec; est completion in 3 minutes [INSERT: Count=584140, Max=9879, Min=324, Avg=546.26, 90=620, 99=954, 99.9=2715, 99.99=4099] [INSERT-COMB: Count=584214, Max=9879, Min=324, Avg=546.27, 90=620, 99=954, 99.9=2715, 99.99=4099] 
2025-03-29 07:38:56:579 680 sec: 39814399 operations; 58504.4 current ops/sec; est completion in 2 minutes [INSERT: Count=585055, Max=7639, Min=338, Avg=545.45, 90=619, 99=948, 99.9=2789, 99.99=4055] [INSERT-COMB: Count=585046, Max=7639, Min=338, Avg=545.44, 90=619, 99=948, 99.9=2789, 99.99=4055] 
2025-03-29 07:39:06:579 690 sec: 40396593 operations; 58219.4 current ops/sec; est completion in 2 minutes [INSERT: Count=582190, Max=8823, Min=339, Avg=548.1, 90=623, 99=963, 99.9=2859, 99.99=4083] [INSERT-COMB: Count=582127, Max=8823, Min=339, Avg=548.1, 90=623, 99=963, 99.9=2859, 99.99=4083] 
2025-03-29 07:39:16:579 700 sec: 40982136 operations; 58554.3 current ops/sec; est completion in 2 minutes [INSERT: Count=585544, Max=7467, Min=346, Avg=544.97, 90=620, 99=945, 99.9=2647, 99.99=3989] [INSERT-COMB: Count=585541, Max=7467, Min=346, Avg=544.97, 90=620, 99=945, 99.9=2647, 99.99=3989] 
2025-03-29 07:39:26:579 710 sec: 41564365 operations; 58222.9 current ops/sec; est completion in 2 minutes [INSERT: Count=582234, Max=7803, Min=338, Avg=548.06, 90=622, 99=956, 99.9=2771, 99.99=4495] [INSERT-COMB: Count=582239, Max=7803, Min=338, Avg=548.06, 90=622, 99=956, 99.9=2771, 99.99=4495] 
2025-03-29 07:39:36:579 720 sec: 42150439 operations; 58607.4 current ops/sec; est completion in 2 minutes [INSERT: Count=586065, Max=8447, Min=344, Avg=544.48, 90=617, 99=939, 99.9=2725, 99.99=4459] [INSERT-COMB: Count=586065, Max=8447, Min=344, Avg=544.48, 90=617, 99=939, 99.9=2725, 99.99=4459] 
2025-03-29 07:39:46:579 730 sec: 42733477 operations; 58303.8 current ops/sec; est completion in 2 minutes [INSERT: Count=583039, Max=9151, Min=347, Avg=547.32, 90=623, 99=961, 99.9=2723, 99.99=4239] [INSERT-COMB: Count=583037, Max=9151, Min=347, Avg=547.32, 90=623, 99=961, 99.9=2723, 99.99=4239] 
2025-03-29 07:39:56:579 740 sec: 43316718 operations; 58324.1 current ops/sec; est completion in 1 minute [INSERT: Count=583244, Max=7663, Min=343, Avg=547.13, 90=620, 99=954, 99.9=2779, 99.99=4367] [INSERT-COMB: Count=583246, Max=7663, Min=343, Avg=547.13, 90=620, 99=954, 99.9=2779, 99.99=4367] 
2025-03-29 07:40:06:579 750 sec: 43900932 operations; 58421.4 current ops/sec; est completion in 1 minute [INSERT: Count=584213, Max=7935, Min=329, Avg=546.21, 90=620, 99=951, 99.9=2751, 99.99=4207] [INSERT-COMB: Count=584214, Max=7935, Min=329, Avg=546.21, 90=620, 99=951, 99.9=2751, 99.99=4207] 
2025-03-29 07:40:16:579 760 sec: 44485781 operations; 58484.9 current ops/sec; est completion in 1 minute [INSERT: Count=584846, Max=8911, Min=345, Avg=545.61, 90=618, 99=947, 99.9=2699, 99.99=4083] [INSERT-COMB: Count=584841, Max=8911, Min=345, Avg=545.61, 90=618, 99=947, 99.9=2699, 99.99=4083] 
2025-03-29 07:40:26:579 770 sec: 45071852 operations; 58607.1 current ops/sec; est completion in 1 minute [INSERT: Count=586071, Max=7807, Min=342, Avg=544.44, 90=618, 99=949, 99.9=2733, 99.99=4003] [INSERT-COMB: Count=586074, Max=7807, Min=342, Avg=544.44, 90=618, 99=949, 99.9=2733, 99.99=4003] 
2025-03-29 07:40:36:579 780 sec: 45653160 operations; 58130.8 current ops/sec; est completion in 1 minute [INSERT: Count=581309, Max=7499, Min=341, Avg=548.95, 90=623, 99=960, 99.9=2735, 99.99=3871] [INSERT-COMB: Count=581303, Max=7499, Min=341, Avg=548.95, 90=623, 99=960, 99.9=2735, 99.99=3871] 
2025-03-29 07:40:46:579 790 sec: 46235283 operations; 58212.3 current ops/sec; est completion in 1 minute [INSERT: Count=582124, Max=9919, Min=350, Avg=548.18, 90=623, 99=957, 99.9=2821, 99.99=4363] [INSERT-COMB: Count=582136, Max=9919, Min=350, Avg=548.18, 90=623, 99=957, 99.9=2821, 99.99=4363] 
2025-03-29 07:40:56:579 800 sec: 46818889 operations; 58360.6 current ops/sec; est completion in 55 seconds [INSERT: Count=583604, Max=7283, Min=343, Avg=546.76, 90=622, 99=965, 99.9=2713, 99.99=4183] [INSERT-COMB: Count=583598, Max=7283, Min=343, Avg=546.76, 90=622, 99=965, 99.9=2713, 99.99=4183] 
2025-03-29 07:41:06:579 810 sec: 47402608 operations; 58371.9 current ops/sec; est completion in 45 seconds [INSERT: Count=583715, Max=7547, Min=350, Avg=546.67, 90=621, 99=954, 99.9=2697, 99.99=4151] [INSERT-COMB: Count=583715, Max=7547, Min=350, Avg=546.67, 90=621, 99=954, 99.9=2697, 99.99=4151] 
2025-03-29 07:41:16:579 820 sec: 47987135 operations; 58452.7 current ops/sec; est completion in 35 seconds [INSERT: Count=584535, Max=6907, Min=333, Avg=545.92, 90=619, 99=949, 99.9=2663, 99.99=4183] [INSERT-COMB: Count=584530, Max=6907, Min=333, Avg=545.92, 90=619, 99=949, 99.9=2663, 99.99=4183] 
2025-03-29 07:41:26:579 830 sec: 48573668 operations; 58653.3 current ops/sec; est completion in 25 seconds [INSERT: Count=586531, Max=7359, Min=339, Avg=544.06, 90=616, 99=936, 99.9=2755, 99.99=4227] [INSERT-COMB: Count=586529, Max=7359, Min=339, Avg=544.06, 90=616, 99=936, 99.9=2755, 99.99=4227] 
2025-03-29 07:41:36:579 840 sec: 49155694 operations; 58202.6 current ops/sec; est completion in 15 seconds [INSERT: Count=582031, Max=11447, Min=343, Avg=548.25, 90=622, 99=956, 99.9=2823, 99.99=4375] [INSERT-COMB: Count=582040, Max=11447, Min=343, Avg=548.25, 90=622, 99=956, 99.9=2823, 99.99=4375] 
2025-03-29 07:41:46:579 850 sec: 49741553 operations; 58585.9 current ops/sec; est completion in 5 second [INSERT: Count=585862, Max=7831, Min=337, Avg=544.66, 90=618, 99=951, 99.9=2683, 99.99=4023] [INSERT-COMB: Count=585856, Max=7831, Min=337, Avg=544.67, 90=618, 99=951, 99.9=2683, 99.99=4023] 
2025-03-29 07:41:53:341 856 sec: 50000000 operations; 38220.5 current ops/sec; [CLEANUP-COMB: Count=32, Max=2014207, Min=1, Avg=62930.47, 90=4, 99=2014207, 99.9=2014207, 99.99=2014207] [CLEANUP: Count=32, Max=2014207, Min=1, Avg=62930.47, 90=4, 99=2014207, 99.9=2014207, 99.99=2014207] [INSERT: Count=258431, Max=7175, Min=344, Avg=542.73, 90=616, 99=946, 99.9=2755, 99.99=4523] [INSERT-COMB: Count=258395, Max=7175, Min=344, Avg=542.72, 90=616, 99=946, 99.9=2755, 99.99=4523] 
[OVERALL], RunTime(ms), 856762
[OVERALL], Throughput(ops/sec), 58359.26429977053
[TOTAL_GCS_PS_Scavenge], Count, 4412
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 8329
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.9721486247055775
[TOTAL_GCS_PS_MarkSweep], Count, 1
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 17
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0019842149861921984
[TOTAL_GCs], Count, 4413
[TOTAL_GC_TIME], Time(ms), 8346
[TOTAL_GC_TIME_%], Time(%), 0.9741328396917697
[CLEANUP-COMB], Operations, 32
[CLEANUP-COMB], AverageLatency(us), 62930.46875
[CLEANUP-COMB], MinLatency(us), 1
[CLEANUP-COMB], MaxLatency(us), 2014207
[CLEANUP-COMB], 50thPercentileLatency(us), 2
[CLEANUP-COMB], 90thPercentileLatency(us), 4
[CLEANUP-COMB], 95thPercentileLatency(us), 8
[CLEANUP-COMB], 99thPercentileLatency(us), 2014207
[CLEANUP-COMB], 99.99PercentileLatency(us), 2014207
[CLEANUP-COMB], 99.99999PercentileLatency(us), 2014207
[CLEANUP], Operations, 32
[CLEANUP], AverageLatency(us), 62930.46875
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 2014207
[CLEANUP], 50thPercentileLatency(us), 2
[CLEANUP], 90thPercentileLatency(us), 4
[CLEANUP], 95thPercentileLatency(us), 8
[CLEANUP], 99thPercentileLatency(us), 2014207
[CLEANUP], 99.99PercentileLatency(us), 2014207
[CLEANUP], 99.99999PercentileLatency(us), 2014207
[INSERT], Operations, 50000000
[INSERT], AverageLatency(us), 544.72607444
[INSERT], MinLatency(us), 323
[INSERT], MaxLatency(us), 221055
[INSERT], 50thPercentileLatency(us), 524
[INSERT], 90thPercentileLatency(us), 619
[INSERT], 95thPercentileLatency(us), 679
[INSERT], 99thPercentileLatency(us), 944
[INSERT], 99.99PercentileLatency(us), 4311
[INSERT], 99.99999PercentileLatency(us), 220671
[INSERT], Return=OK, 50000000
[INSERT-COMB], Operations, 50000000
[INSERT-COMB], AverageLatency(us), 544.72607444
[INSERT-COMB], MinLatency(us), 323
[INSERT-COMB], MaxLatency(us), 221055
[INSERT-COMB], 50thPercentileLatency(us), 524
[INSERT-COMB], 90thPercentileLatency(us), 619
[INSERT-COMB], 95thPercentileLatency(us), 679
[INSERT-COMB], 99thPercentileLatency(us), 944
[INSERT-COMB], 99.99PercentileLatency(us), 4311
[INSERT-COMB], 99.99999PercentileLatency(us), 220671